MPPICInterDyMFoam-Tutorial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -0.03 -0.03 -0.005)
    (  0.03 -0.03 -0.005)
    (  0.03  0.03 -0.005)
    ( -0.03  0.03 -0.005)
    ( -0.03 -0.03  0.13)
    (  0.03 -0.03  0.13)
    (  0.03  0.03  0.13)
    ( -0.03  0.03  0.13)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (55 55 110) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (30 30 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
