MPPICInterDyMFoam-Tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    vessel
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          25386;
        startFace       479170;
    }
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       504556;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       504568;
    }
    shaftRotating
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          1935;
        startFace       504632;
    }
    shaftStatic
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          368;
        startFace       506567;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        
2
(
cyclicAMI
rotating
)
;
        nFaces          15740;
        startFace       506935;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        
2
(
cyclicAMI
rotating
)
;
        nFaces          15740;
        startFace       522675;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
    }
)

// ************************************************************************* //
