MPPICInterDyMFoam-Tutorial/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(0.005 0.0 0.05)
(0.0051 0.0 0.05)
(0.0052 0.0 0.05)
(0.0053 0.0 0.05)
(0.0054 0.0 0.05)
(0.0055 0.0 0.05)
(0.0056 0.0 0.05)
(0.0057 0.0 0.05)
(0.0058 0.0 0.05)
(0.0059 0.0 0.05)
(0.0049 0.0 0.05)
(0.0048 0.0 0.05)
(0.0047 0.0 0.05)
(0.0046 0.0 0.05)
(0.0045 0.0 0.05)
(0.0044 0.0 0.05)
(0.0043 0.0 0.05)
(0.0042 0.0 0.05)
(0.0041 0.0 0.05)
(0.0040 0.0 0.05)
(0.005 0.0 0.049)
(0.0051 0.0 0.049)
(0.0052 0.0 0.049)
(0.0053 0.0 0.049)
(0.0054 0.0 0.049)
(0.0055 0.0 0.049)
(0.0056 0.0 0.049)
(0.0057 0.0 0.049)
(0.0058 0.0 0.049)
(0.0059 0.0 0.049)
(0.0049 0.0 0.049)
(0.0048 0.0 0.049)
(0.0047 0.0 0.049)
(0.0046 0.0 0.049)
(0.0045 0.0 0.049)
(0.0044 0.0 0.049)
(0.0043 0.0 0.049)
(0.0042 0.0 0.049)
(0.0041 0.0 0.049)
(0.0040 0.0 0.049)
(0.0050 0.0 0.048)
(0.0051 0.0 0.048)
(0.0052 0.0 0.048)
(0.0053 0.0 0.048)
(0.0054 0.0 0.048)
(0.0055 0.0 0.048)
(0.0056 0.0 0.048)
(0.0057 0.0 0.048)
(0.0058 0.0 0.048)
(0.0059 0.0 0.048)
(0.0049 0.0 0.048)
(0.0048 0.0 0.048)
(0.0047 0.0 0.048)
(0.0046 0.0 0.048)
(0.0045 0.0 0.048)
(0.0044 0.0 0.048)
(0.0043 0.0 0.048)
(0.0042 0.0 0.048)
(0.0041 0.0 0.048)
(0.0040 0.0 0.048)
(0.0050 0.0 0.047)
(0.0051 0.0 0.047)
(0.0052 0.0 0.047)
(0.0053 0.0 0.047)
(0.0054 0.0 0.047)
(0.0055 0.0 0.047)
(0.0056 0.0 0.047)
(0.0057 0.0 0.047)
(0.0058 0.0 0.047)
(0.0059 0.0 0.047)
(0.0049 0.0 0.047)
(0.0048 0.0 0.047)
(0.0047 0.0 0.047)
(0.0046 0.0 0.047)
(0.0045 0.0 0.047)
(0.0044 0.0 0.047)
(0.0043 0.0 0.047)
(0.0042 0.0 0.047)
(0.0041 0.0 0.047)
(0.0040 0.0 0.047)
(0.0050 0.0 0.046)
(0.0051 0.0 0.046)
(0.0052 0.0 0.046)
(0.0053 0.0 0.046)
(0.0054 0.0 0.046)
(0.0055 0.0 0.046)
(0.0056 0.0 0.046)
(0.0057 0.0 0.046)
(0.0058 0.0 0.046)
(0.0059 0.0 0.046)
(0.0049 0.0 0.046)
(0.0048 0.0 0.046)
(0.0047 0.0 0.046)
(0.0046 0.0 0.046)
(0.0045 0.0 0.046)
(0.0044 0.0 0.046)
(0.0043 0.0 0.046)
(0.0042 0.0 0.046)
(0.0041 0.0 0.046)
(0.0040 0.0 0.046)
)

// ************************************************************************* //
