MPPICInterDyMFoam-Tutorial/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vessel
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type           fixedValue;
        value          uniform (0 0 -0.1);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    shaftRotating
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    shaftStatic
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
